## Format data to get a dataframe with the number of times each school appears

In [1]:
import pandas as pd
# pd.set_option('max_rows', None)

/Users/ilenapeng/.pyenv/versions/3.9.7/lib/python3.9/site-packages/pandas/compat/__init__.py:124: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
df = pd.read_csv('03-clean.csv')
df.head()

,school1_alt,school2_alt,school3_alt,lastname,firstname,suffix,name,year1,school2,year2,school3,year3,school4,year4,school5,year5,circuit
0,Yale University,NaN,NaN,Colt,LeBaron Bradford,NaN,"Colt, LeBaron Bradford",1868.0,Columbia University,1870.0,NaN,NaN,NaN,NaN,NaN,NaN,First
1,Bowdoin College,NaN,NaN,Putnam,William LeBaron,NaN,"Putnam, William LeBaron",1855.0,NaN,1858.0,NaN,NaN,NaN,NaN,NaN,NaN,First
2,Harvard University,NaN,NaN,Lowell,Francis Cabot,NaN,"Lowell, Francis Cabot",1876.0,Harvard University,1879.0,NaN,NaN,NaN,NaN,NaN,NaN,First
3,Harvard University,NaN,NaN,Schofield,William,NaN,"Schofield, William",1883.0,Harvard University,NaN,NaN,NaN,NaN,NaN,NaN,NaN,First
4,Harvard University,NaN,NaN,Dodge,Frederic,NaN,"Dodge, Frederic",1867.0,Harvard University,1869.0,NaN,NaN,NaN,NaN,NaN,NaN,First

In [3]:
long_df = pd.melt(df, id_vars=['name', 'circuit', 'lastname', 'firstname'], value_vars=['school1_alt', 'school2_alt', 'school3_alt', 'school2', 'school3', 'school4', 'school5'], value_name='school')
long_df.head()

,name,circuit,lastname,firstname,variable,school
0,"Colt, LeBaron Bradford",First,Colt,LeBaron Bradford,school1_alt,Yale University
1,"Putnam, William LeBaron",First,Putnam,William LeBaron,school1_alt,Bowdoin College
2,"Lowell, Francis Cabot",First,Lowell,Francis Cabot,school1_alt,Harvard University
3,"Schofield, William",First,Schofield,William,school1_alt,Harvard University
4,"Dodge, Frederic",First,Dodge,Frederic,school1_alt,Harvard University

In [4]:
# To make a table of people from each school in total, across all circuits

count_all_df = pd.DataFrame(long_df.school.value_counts()).reset_index()
count_all_df.columns = ['school', 'count']

len(count_all_df)

276

In [5]:
count_by_circuit_df = pd.DataFrame(long_df.groupby('circuit').school.value_counts().reset_index(name='count'))

# rearrange columns to merge with the above dataframe
count_by_circuit_df = count_by_circuit_df[['school', 'count', 'circuit']]

len(count_by_circuit_df)

591

In [6]:
count_by_circuit_df.to_csv('04-format.csv', index=False)
count_all_df.to_csv('04-format-table.csv', index=False)